{
  "description": "This allows your customer to pay via a NIP (NIBBS Instant Payment) transfer.",
  "endpoint": "POST /charges?type=bank_transfer",
  "headers": {
    "Authorization": "Bearer {Secret Key}",
    "Content-Type": "application/json"
  },
  "request_spec": {
    "type": "post_body",
    "spec": {
      "tx_ref": "Required - true: Required - false: This is a unique reference, unique to the particular transaction being carried out. It is generated by the merchant for every transaction.",
      "amount": "Required - true: This is the amount to be charged it is passed as - (“amount”:10). Minimum amount for GHS is 1 GHS",
      "fullname": "Required - false: Should include first and last name of the customer",
      "email": "Required - true: This is the email address of the customer.",
      "phone_number": "Required - false: This is the phone number linked to the customer's mobile money account.",
      "subaccounts": "Required - false: This is an array of objects containing the subaccount IDs to split the payment into.",
      "client_ip": "Required - false: IP - Internet Protocol. This represents the current IP address of the customer carrying out the transaction.",
      "device_fingerprint": "Required - false: This is the fingerprint for the device being used. It can be generated using a library on whatever platform is being used.",
      "currency": "Required: true : This is the specified currency to charge in.",
      "duration": "Required - false: This is represented in days e.g. passing 2 means 2 days. It is the expiry date for the account number. Setting to 2 would mean you want the account number to exist for 2 days before expiring.",
      "frequency": "Required - false: This is the number of times a generated account number can receive payments. Represented as an Integer e.g. 'frequency': 10 means the account can receive payments up to 10 times before expiring.",
      "narration": "Required - false: This allows the developer set the name that is shown to the customer when the account is resolved to a name. It also displays in the debit narration.",
      "is_permanent": "Required - false: This allows you create a static account number i.e. the account number doesn't change and customers can pay into the account number multiple times.",
      "meta": "Required - false: This is to include additional payment information"
    }
  },
  "sample_request": {
    "tx_ref": "MC-1585230950508",
    "amount": "1500",
    "email": "johnmadakin@gmail.com",
    "phone_number": "054709929220",
    "currency": "NGN",
    "client_ip": "154.123.220.1",
    "device_fingerprint": "62wd23423rq324323qew1",
    "subaccounts": [
      {
        "id": "RS_D87A9EE339AE28BFA2AE86041C6DE70E"
      }
    ],
    "duration": 2,
    "frequency": 5,
    "narration": "All star college salary for May",
    "is_permanent": 1,
    "meta": {
      "flightId": "AE31213"
    }
  },
  "sample_response": {
    "status": "success",
    "message": "Charge initiated",
    "meta": {
      "authorization": {
        "transfer_reference": "FLW-ee58c31372724f2889b8211a5a477bb1",
        "transfer_account": "7825397990",
        "transfer_bank": "WEMA BANK",
        "account_expiration": "2020-03-27 09:53:39",
        "transfer_note": "Please make a bank transfer to Yemi Desola",
        "transfer_amount": 1500,
        "mode": "banktransfer"
      }
    }
  }
}
