{
  "description": "This meta describes how to perform payments using the Flutterwave standard method",
  "endpoint": "POST /payments",
  "headers": {
    "Authorization": "Bearer {Secret Key}",
    "Content-Type": "application/json"
  },
  "request_spec": {
    "type": "post_body",
    "payload": {
      "tx_ref": "Required - true: This is a unique reference, unique to the particular transaction being carried out. It is generated by the merchant for every transaction.",
      "amount": "Required - true: This is the amount to be charged it is passed as - (“amount”:10).",
      "currency": "Required: true : This is the specified currency of the transaction. With Flutterwave you can charge cards in more than 90 currencies, all you need to do is pass the specified currency you would like to charge the in.",
      "customer": "Required - false: This is an object that can accept email, phonenumber and name e.g -   'customer': {'email': 'example@example.com','phonenumber': '08012345678','name': 'Takeshi Kovacs'}",
      "subaccounts": "Required - false: This is an array of objects containing the subaccount IDs to split the payment into.",
      "payment_options": "Required - true: This specifies that the payment options to be displayed e.g - card,mobilemoney,ussd",
      "redirect_url": "Required - true: This is a url you provide, we redirect to it after the customer completes payment and append the response to it as query parameters. (3DSecure only)",
      "payment_plan": "Required - false: This is the ID for doing recurring payments. E.g. 10",
      "payment_page": "Required - false: This is the payment page ID",
      "meta": "Required - false: This is to include additional payment information and should an object e.g {'consumer_id': 23,'consumer_mac': '92a3-912ba-1192a'}",
      "customizations": "Required - false: This is an object that should contain title, logo, and description you want to display on the modal e.g {'title': 'Pied Piper Payments','description': 'Middleout isn't free. Pay the price','logo': 'https://assets.piedpiper.com/logo.png'}"
    }
  },
  "sample_response": {
    "status": "success",
    "message": "Hosted Link",
    "data": {
        "link": "http://api.ravepay.co/v3/payments/57e5e112905b1c432bc2"
    }
  }
}