{
  "description": "This page describes how to collect (NGN) payments via USSD.",
  "endpoint": "POST /v3/charges",
  "request_spec": {
    "type": "post_body",
    "spec": {
      "account_bank": "Required - true : This is the Bank numeric code e.g 058",
      "tx_ref": "Required - true: Required - false: This is a unique reference, unique to the particular transaction being carried out. It is generated by the merchant for every transaction.",
      "amount": "Required - true: This is the amount to be charged it is passed as - (“amount”:`100`). N.B. Amount should not be less than 100.",
      "currency": "Required: true : This is the specified currency to charge in. (Expected value: NGN)",
      "fullname": "Required - false: Should include first and last name of the customer",
      "email": "Required - true: This is the email address of the customer.",
      "phone_number": "Required - false: This is the phone number linked to the customer's mobile money account.",
      "subaccounts": "Required - false: This is an array of objects containing the subaccount IDs to split the payment into.",
      "client_ip": "Required - false: IP - Internet Protocol. This represents the current IP address of the customer carrying out the transaction.",
      "device_fingerprint": "Required - false: This is the fingerprint for the device being used. It can be generated using a library on whatever platform is being used.",
      "type": "Required - true: This recognises the payment type as USSD payment",
      "meta": "Required - false: This is to include additional payment information"
    }
  },
  "sample_request": {
    "tx_ref": "MC-15852309v5050e8",
    "account_bank": "058",
    "amount": "1500",
    "type": "ussd",
    "currency": "NGN",
    "email": "johnmadakin@gmail.com",
    "phone_number": "054709929220",
    "fullname": "John Madakin",
    "client_ip": "154.123.220.1",
    "device_fingerprint": "62wd23423rq324323qew1",
    "meta": {
      "matric_no": "0831"
    }
  },
  "sample_response": {
    "status": "success",
    "message": "Charge initiated",
    "data": {
      "payment_code": "8758"
    },
    "meta": {
      "authorization": {
        "mode": "ussd",
        "note": "*889*767*8758#"
      }
    }
  }
}